## Akses nilai variabel pada Query ()

## Import Modules :
modul yang kita import ada 2 antara lain :

1. pandas
2. numpy

In [1]:
import pandas as pd
import numpy as np

- Setelah itu sebaiknya kita mengecek terlebih dahulu versi pandas dan numpy yang kita gunakan saat ini, bertujuan agar apabila terjadi perbedaan output atau tampilan itu kemungkinan besar di sebabkan oleh perbedaan versi yang di gunakan.

In [2]:
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

## Persiapan Data Frame 

- n_rows untuk menentukan jumlah baris yang ingin kita buat 
- n_cols untuk menentukan jumlah kolom yang yang ingin kita buat
- randint untuk menampilkan nilai secara acak berdasarkan jumlah yang ditentukan

In [4]:
n_rows = 5
n_cols = 5
cols = tuple ('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                  columns=cols)
df

    A   B   C   D   E
0   9   2   2  17   7
1   8  12  17   8   2
2  10  16   1   2   7
3   8  13  14   9  16
4  13  18  19   4  17

## Akses nilai variabel pada Query()

- df.query digunakan untuk melakukan seleksi baris

In [5]:
df.query('A > 5')

    A   B   C   D   E
0   9   2   2  17   7
1   8  12  17   8   2
2  10  16   1   2   7
3   8  13  14   9  16
4  13  18  19   4  17

In [6]:
rerata = df['A'].mean()
rerata

9.6

In [7]:
df.query('A > @rerata')

    A   B   C  D   E
2  10  16   1  2   7
4  13  18  19  4  17